# reverse - переворот строки 
# each - каждый

# 1..5  (вывод: 1 2 3 4 5)
# 1...5 (вывод: 1 2 3 4 ) без последней позиции


#       Ranges
#--------------------------------------------------
puts "Пример 1:"
(1...10).each do |x|   
    puts x
end                

puts "--------------------------------------------------"
puts "Пример 2:"
(1..10).each {|x| puts x}   # тоже самое в одну строку 

puts "--------------------------------------------------"
puts "Пример 3:"
(-2..2).each {|x| puts x}
puts "========"
(0..5).each {|x| puts x}
puts "========"
(10..11).each {|x| puts x}

puts "--------------------------------------------------"
puts "Пример 4:"
("a".."b").each {|x| puts x}
puts "========"
("aa".."bb").each {|x| puts x}
puts "========"
("aaa"..."bbb").each {|x| print " #{x}"}
puts "========"
("10a".."11b").each {|x| print " #{x}"}